Revit 2026 API

# FileExportingEventArgs Class

---

The event arguments used by the FileExporting event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPreEventArgs Autodesk.Revit.DB.EventsRevitAPIPreDocEventArgs Autodesk.Revit.DB.EventsFileExportingEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FileExportingEventArgs : RevitAPIPreDocEventArgs
```
```vb
Public Class FileExportingEventArgs
	Inherits RevitAPIPreDocEventArgs
```
```cpp
public ref class FileExportingEventArgs : public RevitAPIPreDocEventArgs
```
```fsharp
type FileExportingEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
```

The FileExportingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BackgroundOperation | Identifies whether the event belongs to a background export operation. |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Document | The document associated with the event. (Inherited from RevitAPIPreDocEventArgs) |
|  | Format | Identifies the export format, e.g. DWG or image. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | Path | The target path for the export. |

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | When the event is cancellable, may call the Cancel() method to cancel it. (Inherited from RevitAPIPreEventArgs) |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace